ThirdParty-v2012/swak4Foam-latest/Examples/groovyBC/pulsedPitzDaily/0.org/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 2e-05;

boundaryField
{
    inlet
    {
        #include "$FOAM_CASE/constant/transportProperties"

        type            groovyBC;
        variables "kAvg{}=sum(theKFieldItself*vol())/sum(vol());";
        valueExpression "0.5*(kAvg+2*$[(dimensionedScalar)nu])";
        aliases  {
            // just for testing
            theKFieldItself k;
        };
        value           uniform 2e-05;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform 0;
        value           uniform 0;
    }

    upperWall
    {
        type            fixedValue;
        value           uniform 0;
    }

    lowerWall
    {
        type            fixedValue;
        value           uniform 0;
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
